<script setup lang="ts">
import HeaderComponent from './subComponents/HeaderComponent.vue'
</script>

<template>
  <HeaderComponent class="header-component" />
  <main>
    <section class="about-section" id="section-about-website">
      <h2>О проекте</h2>
      <p>
        Этот сайт является аналогом системы закладок в браузерах. В современном мире информационных
        технологий в Интернете существуют миллионы интернет-ресурсов, к которым мы хотели бы всегда
        иметь быстрый доступ. Однако различные способы сохранения этих ссылок в быстром доступе в
        современных браузерах имеют свои недостатки.
      </p>
      <p>
        Закладки занимают довольно много места в верхней или боковой панели браузера без возможности
        быстрого поиска нужного сайта, что портит работу пользователя.
      </p>
      <p>
        Затем браузеры придумали "группы" и "папки" сайтов, которые просто скрывали группу закладок
        под значком одной папки. Это решает проблему переполненности верхней панели браузера, но
        значительно затрудняет поиск нужного сохраненного сайта, если назначение сайта неоднозначно
        или пользователь неправильно выстроил иерархию и названия папок и сайтов в них.
      </p>
      <p>
        Важной проблемой является отсутствие синхронизации сохраненных вкладок между разными
        браузерами. Для некоторых это является преимуществом, поскольку таким образом можно
        логически разграничить область использования конкретного браузера, не отвлекаясь от
        конкретной задачи. Однако существует множество ресурсов, которые одинаково часто требуются,
        независимо от круга задач, для которых пользователь использует разные браузеры. Кроме того,
        эту задачу решают те самые папки, которые скрывают множество ненужных на данный момент
        сайтов.
      </p>
      <p>
        Наконец, бывают случаи, когда из-за ошибок в системе пользователя или из-за ошибок,
        допущенных самим пользователем, теряется вся информация о назначенных сайтах и группах
        сайтов. Современные браузеры имеют собственные механизмы восстановления пользовательских
        данных, например, "историю" и рекомендацию по регистрации аккаунта в системе. Однако эти
        операции требуют дополнительных действий и часто привязаны к конкретному браузеру, а иногда
        и к технике пользователя.
      </p>
      <p>
        Сайт, на котором вы сейчас находитесь, предназначен для решения вышеперечисленных проблем, с
        которыми сам разработчик сайта сталкивался в реальной жизни. Вы можете сохранить на нем
        огромное количество ссылок на интернет-ресурсы и иметь быстрый доступ к ним независимо от
        браузера без риска потери данных из-за аварийного отключения электроэнергии в вашем здании.
      </p>
      <p>
        <span style="font-weight: bold; text-decoration: underline">
          Пожалуйста, обратите внимание, что этот сайт является домашним проектом разработчика с
          ником DER-2SH-KA на GitHub под лицензией MIT. Это означает, что разработчик не несет
          ответственности за любой ущерб, причиненный использованием продукта и потерей данных.
          Однако разработчик постарается избежать любых неприятных впечатлений о сервисе, связанных
          с технической составляющей проекта.
        </span>
      </p>
    </section>
  </main>
</template>

<style lang="scss">
body {
  background-color: var(--background-color-dark-theme);
}

#app {
  display: flex;
  flex-direction: column;
  min-height: 100vh;
}

.header-component {
  position: sticky;
  top: 0;
}

main {
  display: flex;
  flex-direction: column;
  justify-content: start;
  align-items: center;
}

.about-section {
  display: flex;
  flex-direction: column;
  justify-content: start;
  align-items: start;

  color: white;
  margin: 50px;

  & > h2 {
    text-indent: 1.25cm;
    font-size: 22pt;
    font-weight: bold;
  }

  & > p {
    text-indent: 1.25cm;
    font-size: 16pt;
    font-weight: normal;
  }
}

@media (max-width: 768px) {
  .about-section {
    & > h2 {
      font-size: 18pt;
    }

    & > p {
      font-size: 14pt;
    }
  }
}
</style>
